public/roam/project/UNSW/ISO(202603)/strassen.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-05-08 Fri 18:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Strassen</title>
<meta name="generator" content="Org Mode" />
<meta name="color-scheme" content="light" />
<link rel="stylesheet" href="../../../../css/retro.css?v=20260426-19" />
<link rel="shortcut icon" href="https://raw.githubusercontent.com/AaronHnoraA/AaronHnoraA.github.io/refs/heads/master/css/cv.svg" type="image/x-icon">

</head>
<body class="note-page" data-note-title="Strassen" data-note-group="project" data-note-date="2026-05-08">
<div id="content" class="content">
<a id="ID-0953618D-8E10-4011-92E5-8A5246591A14" class="org-id-anchor" aria-hidden="true"></a>
<header>
<h1 class="title">Strassen</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc50c4b7">总览</a></li>
<li><a href="#org1aabeb5">核心概念</a>
<ul>
<li><a href="#org3bb70f1">Matrix multiplication exponent</a></li>
<li><a href="#org8127620">Bilinear map</a></li>
<li><a href="#orgbd5f5c0">Tensor representation of a bilinear map</a></li>
<li><a href="#org34e9537">Matrix multiplication tensor</a></li>
</ul>
</li>
<li><a href="#orgb99b001">证明路线</a>
<ul>
<li><a href="#orge2e4fef">Step 1: Matrix multiplication to bilinear rank</a></li>
<li><a href="#org2982da7">Step 2: Bookkeeping</a></li>
<li><a href="#org3f9f315">Step 3: Restriction preorder</a></li>
<li><a href="#org70c4270">Step 4: Exact comparison to approximate comparison</a></li>
<li><a href="#org5b8b540">Step 5: Geometry to polynomial degeneration</a></li>
<li><a href="#org1d42439">Step 6: Interpolation and extra diagonal tensor</a></li>
<li><a href="#org5cb5215">Step 7: Support, partition, and mass extraction</a></li>
</ul>
</li>
<li><a href="#orgfa5ed5e">Bilinear Maps and Tensors</a>
<ul>
<li><a href="#orgaa9a63c">From bilinear maps to tensors</a></li>
<li><a href="#org76a666a">Rank-one bilinear maps</a></li>
<li><a href="#org46009cf">Tensor rank</a></li>
<li><a href="#org4603bcf">Standard diagonal tensor</a></li>
</ul>
</li>
<li><a href="#orgaaa6873">Restriction</a>
<ul>
<li><a href="#orgac0dc66">Definition</a></li>
<li><a href="#orgdae4f6a">Restriction as simulation</a></li>
</ul>
</li>
<li><a href="#orgffb6b8c">Rank and Restriction</a>
<ul>
<li><a href="#org11a7f1a">Monotonicity of rank</a></li>
<li><a href="#org044aaea">Rank via restriction to diagonal tensor</a></li>
</ul>
</li>
<li><a href="#org599bf18">Direct Sum and Tensor Product</a>
<ul>
<li><a href="#org9145a03">Direct sum</a></li>
<li><a href="#org29d33ed">Tensor product</a></li>
<li><a href="#org01e10bd">Difference between \(\oplus\) and \(\otimes\)</a></li>
<li><a href="#org4eb8c78">Why direct sum matters</a></li>
</ul>
</li>
<li><a href="#orgcb8c978">Semiring Viewpoint</a>
<ul>
<li><a href="#orgf5647f5">Ring</a></li>
<li><a href="#orgc6709a2">Semiring</a></li>
<li><a href="#orgf7bc1f1">Tensor isomorphism classes as a semiring</a></li>
<li><a href="#org6c3ce38">Why semiring language is useful</a></li>
</ul>
</li>
<li><a href="#orgb3a316c">Asymptotic and Border Rank</a>
<ul>
<li><a href="#org233edaf">Asymptotic rank</a></li>
<li><a href="#org9bc7f1e">Why asymptotic rank matters</a></li>
<li><a href="#org919c3fb">Border rank</a></li>
<li><a href="#orgf7b5e12">Degeneration</a></li>
<li><a href="#orgdc57e75">From degeneration to exact restriction with overhead</a></li>
</ul>
</li>
<li><a href="#orgd7a2f12">Laser Method Intuition</a>
<ul>
<li><a href="#org4e4473c">Problem</a></li>
<li><a href="#org28995cc">Goal</a></li>
<li><a href="#org3b7bd25">Laser idea</a></li>
<li><a href="#org89ed1bf">Support and weights</a></li>
<li><a href="#org0e97434">Mass extraction</a></li>
</ul>
</li>
<li><a href="#org1047a8f">Krull-Schmidt and Decomposition</a>
<ul>
<li><a href="#orgde586c5">Indecomposable tensors</a></li>
<li><a href="#org7c4f037">Krull-Schmidt theorem</a></li>
<li><a href="#org5979c46">Basis as finest one-dimensional decomposition</a></li>
</ul>
</li>
<li><a href="#org23e8a89">Linear Algebra Rewritten by Direct Sum and Tensor Product</a>
<ul>
<li><a href="#org953b1f8">Traditional order</a></li>
<li><a href="#orgc01ba63">Tensor-complexity order</a></li>
<li><a href="#orgafb9618">Vector spaces</a></li>
<li><a href="#org872be8f">Linear maps as block matrices</a></li>
<li><a href="#org7e790d3">Dual space</a></li>
<li><a href="#org4153b75">Linear maps as tensors</a></li>
<li><a href="#orga1a0786">Bilinear maps as tensors</a></li>
</ul>
</li>
<li><a href="#orga1ca427">Proof Templates</a>
<ul>
<li><a href="#org62864fa">Template: prove restriction monotonicity of rank</a></li>
<li><a href="#orgfebdc6f">Template: prove \(R(t)\leq r\iff t\leq \langle r\rangle\)</a></li>
<li><a href="#org99cdc04">Template: explain direct sum</a></li>
<li><a href="#org92e6dba">Template: explain tensor product</a></li>
<li><a href="#org6a731d7">Template: explain restriction</a></li>
<li><a href="#org683a115">Template: explain border rank</a></li>
<li><a href="#org8f338ff">Template: explain laser method</a></li>
</ul>
</li>
<li><a href="#org7285a0c">Common Mistakes</a>
<ul>
<li><a href="#org874a279">Mistake 1: Confusing restriction direction</a></li>
<li><a href="#orgbe90026">Mistake 2: Confusing direct sum and tensor product</a></li>
<li><a href="#org0d7315f">Mistake 3: Thinking border rank is exact rank</a></li>
<li><a href="#org381f409">Mistake 4: Treating tensor coordinates as intrinsic</a></li>
<li><a href="#org73c74a2">Mistake 5: Forgetting asymptotic behavior</a></li>
</ul>
</li>
<li><a href="#orgefd9ab0">Minimal Memory Version</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgc50c4b7" class="outline-2">
<h2 id="orgc50c4b7">总览</h2>
<div class="outline-text-2" id="text-orgc50c4b7">
<p>
这份笔记围绕 Strassen 1987 中的 tensor complexity / asymptotic rank / laser method 思想展开。
</p>

<p>
核心问题：
</p>

<div class="question" id="org96b8bd4">
<p>
How can we compare bilinear computational problems using tensors, restriction, degeneration, and asymptotic rank?
</p>

</div>

<p>
中文主线：
</p>

<ul class="org-ul">
<li>把矩阵乘法看成 bilinear map。</li>
<li>把 bilinear map 写成 tensor。</li>
<li>用 tensor rank 表示“需要多少次乘法”。</li>
<li>用 restriction 表示“一个问题能模拟另一个问题”。</li>
<li>用 border rank / degeneration 表示“极限意义下近似模拟”。</li>
<li>用 asymptotic rank 研究规模变大时的增长率。</li>
<li>用 laser method 从 tensor powers 中抽取大量独立的 matrix multiplication tensors。</li>
<li>最终得到矩阵乘法指数 \(\omega\) 的上界。</li>
</ul>

<summary id="org4c0f184">
<p>
Strassen 的思想不是只研究一个固定 tensor 的 rank，而是研究 tensor 在 direct sum、tensor product、restriction、degeneration、asymptotic limit 下形成的复杂度结构。
</p>
</summary>
</div>
</div>
<div id="outline-container-org1aabeb5" class="outline-2">
<h2 id="org1aabeb5">核心概念</h2>
<div class="outline-text-2" id="text-org1aabeb5">
</div>
<div id="outline-container-org3bb70f1" class="outline-3">
<h3 id="org3bb70f1">Matrix multiplication exponent</h3>
<div class="outline-text-3" id="text-org3bb70f1">
<div class="defn" id="org071c3e0">
<p>
The matrix multiplication exponent \(\omega\) is the infimum of all real numbers \(\tau\) such that \(n\times n\) matrix multiplication can be computed using
\[
O(n^{\tau+\epsilon})
\]
arithmetic operations for every \(\epsilon>0\).
</p>

</div>

<p>
更直观地说：
</p>

<p>
\[
\omega
=
\inf\{\tau : \text{matrix multiplication has complexity } O(n^{\tau+o(1)})\}.
\]
</p>

<div class="note" id="org56db32e">
<p>
中文：\(\omega\) 描述的是矩阵乘法复杂度的渐近增长率，不是某个固定 \(n\) 的精确乘法次数。
</p>

</div>
</div>
</div>
<div id="outline-container-org8127620" class="outline-3">
<h3 id="org8127620">Bilinear map</h3>
<div class="outline-text-3" id="text-org8127620">
<div class="defn" id="org74f70f5">
<p>
A bilinear map over a field \(K\) is a map
\[
f:U\times V\to W
\]
such that \(f\) is linear in each variable separately.
</p>

</div>

<p>
Examples:
</p>

<ul class="org-ul">
<li>scalar multiplication,</li>
<li>polynomial multiplication,</li>
<li>matrix multiplication,</li>
<li>tensor contraction.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd5f5c0" class="outline-3">
<h3 id="orgbd5f5c0">Tensor representation of a bilinear map</h3>
<div class="outline-text-3" id="text-orgbd5f5c0">
<p>
Given finite-dimensional vector spaces \(U,V,W\), a bilinear map
</p>

<p>
\[
f:U\times V\to W
\]
</p>

<p>
corresponds canonically to a tensor
</p>

<p>
\[
t_f\in U^*\otimes V^*\otimes W.
\]
</p>

<div class="note" id="org07226ef">
<p>
中文直觉：bilinear map 有两个输入槽和一个输出槽；tensor \(U^*\otimes V^*\otimes W\) 正好表达“两个输入探针 + 一个输出方向”。
</p>

</div>

<p>
If bases are chosen, we can write
</p>

<p>
\[
f(u,v)
=
\sum_{i,j,k} t_{ijk} x_i^*(u)y_j^*(v)w_k.
\]
</p>

<p>
So the coefficients \(t_{ijk}\) form a 3-dimensional array.
</p>
</div>
</div>
