public/roam/project/UNSW/ISO(202603)/strassen.html
<div id="outline-container-org34e9537" class="outline-3">
<h3 id="org34e9537">Matrix multiplication tensor</h3>
<div class="outline-text-3" id="text-org34e9537">
<p>
The multiplication of an \(m\times n\) matrix and an \(n\times p\) matrix is a bilinear map
</p>

<p>
\[
\operatorname{Mat}_{m,n}\times \operatorname{Mat}_{n,p}\to \operatorname{Mat}_{m,p}.
\]
</p>

<p>
Its associated tensor is usually denoted
</p>

<p>
\[
\langle m,n,p\rangle.
\]
</p>

<p>
In particular, square \(n\times n\) matrix multiplication is
</p>

<p>
\[
\langle n,n,n\rangle.
\]
</p>
</div>
</div>
</div>
<div id="outline-container-orgb99b001" class="outline-2">
<h2 id="orgb99b001">证明路线</h2>
<div class="outline-text-2" id="text-orgb99b001">
<p>
根据你的 page 4 笔记，整篇证明可以按以下路线理解。
</p>
</div>
<div id="outline-container-orge2e4fef" class="outline-3">
<h3 id="orge2e4fef">Step 1: Matrix multiplication to bilinear rank</h3>
<div class="outline-text-3" id="text-orge2e4fef">
<summary id="orgf75f363">
<p>
文章开场先解释矩阵乘法指数 \(\omega\) 的意义，然后把矩阵乘法复杂度翻译成 bilinear rank / tensor rank 语言。
</p>
</summary>

<p>
三个核心工具：
</p>

<ol class="org-ol">
<li>bilinear rank / tensor rank；</li>
<li>degeneration / border rank；</li>
<li>laser method。</li>
</ol>
</div>
</div>
<div id="outline-container-org2982da7" class="outline-3">
<h3 id="org2982da7">Step 2: Bookkeeping</h3>
<div class="outline-text-3" id="text-org2982da7">
<p>
把计算问题编码成 tensor。
</p>

<div class="note" id="org1a7227a">
<p>
也就是把“输入、输出、乘法次数”从算法语言改写成张量分解语言。
</p>

</div>

<p>
矩阵乘法复杂度问题变成：
</p>

<div class="question" id="org258128a">
<p>
Can we decompose the matrix multiplication tensor into few simple rank-one tensors?
</p>

</div>
</div>
</div>
<div id="outline-container-org3f9f315" class="outline-3">
<h3 id="org3f9f315">Step 3: Restriction preorder</h3>
<div class="outline-text-3" id="text-org3f9f315">
<p>
建立复杂度比较关系：
</p>

<p>
\[
f\leq g.
\]
</p>

<p>
含义：
</p>

<blockquote>
<p>
\(f\) can be obtained from \(g\) by linear transformations on the input and output tensor legs.
</p>
</blockquote>

<p>
计算意义：
</p>

<blockquote>
<p>
If \(f\leq g\), then \(g\) can simulate \(f\).
</p>
</blockquote>

<p>
因此 rank 具有单调性：
</p>

<p>
\[
f\leq g
\implies
R(f)\leq R(g).
\]
</p>
</div>
</div>
<div id="outline-container-org70c4270" class="outline-3">
<h3 id="org70c4270">Step 4: Exact comparison to approximate comparison</h3>
<div class="outline-text-3" id="text-org70c4270">
<p>
从 exact restriction 推广到 approximate restriction / degeneration。
</p>

<div class="note" id="org74b7988">
<p>
中文：不仅允许“精确做出来”，也允许“作为极限做出来”。
</p>

</div>

<p>
这引出 border rank。
</p>
</div>
</div>
<div id="outline-container-org5b8b540" class="outline-3">
<h3 id="org5b8b540">Step 5: Geometry to polynomial degeneration</h3>
<div class="outline-text-3" id="text-org5b8b540">
<p>
几何极限可以改写成带参数的 polynomial family。
</p>

<p>
大致思想：
</p>

<p>
\[
t_\epsilon \to t
\quad
\text{as}
\quad
\epsilon\to 0.
\]
</p>

<p>
如果 \(t_\epsilon\) 对每个非零 \(\epsilon\) 都能由某个 tensor 限制得到，那么 \(t\) 是其 degeneration。
</p>
</div>
</div>
<div id="outline-container-org1d42439" class="outline-3">
<h3 id="org1d42439">Step 6: Interpolation and extra diagonal tensor</h3>
<div class="outline-text-3" id="text-org1d42439">
<p>
参数化 degeneration 可以通过 interpolation 转换成 exact restriction，但需要额外付出一个 diagonal tensor 因子。
</p>

<p>
中文理解：
</p>

<blockquote>
<p>
极限对象不能直接精确得到，但可以把参数多项式在若干点取值，然后通过插值重建目标系数。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5cb5215" class="outline-3">
<h3 id="org5cb5215">Step 7: Support, partition, and mass extraction</h3>
<div class="outline-text-3" id="text-org5cb5215">
<p>
选择一个特殊 tensor，做 support partition，制造一个子结构，然后用前面的 exact/approximate 比较工具，从 tensor powers 中抽取很多 independent matrix multiplication tensors。
</p>

<p>
最终路线：
</p>

<p>
\[
\text{exact order}
\to
\text{approximate order}
\to
\text{formalization over } K(\epsilon)
\to
\text{weight certificate on support}
\to
\text{mass extraction}
\to
\omega\text{-theorem}.
\]
</p>
</div>
</div>
</div>
<div id="outline-container-orgfa5ed5e" class="outline-2">
<h2 id="orgfa5ed5e">Bilinear Maps and Tensors</h2>
<div class="outline-text-2" id="text-orgfa5ed5e">
</div>
<div id="outline-container-orgaa9a63c" class="outline-3">
<h3 id="orgaa9a63c">From bilinear maps to tensors</h3>
<div class="outline-text-3" id="text-orgaa9a63c">
<p>
Let
</p>

<p>
\[
f:U\times V\to W.
\]
</p>

<p>
Choosing bases of \(U,V,W\), we can write
</p>

<p>
\[
f(u,v)
=
\sum_{i,j,k} t_{ijk}x_i^*(u)y_j^*(v)w_k.
\]
</p>

<p>
Therefore
</p>

<p>
\[
t_f
=
\sum_{i,j,k}t_{ijk}x_i^*\otimes y_j^*\otimes w_k
\in U^*\otimes V^*\otimes W.
\]
</p>

<div class="important" id="org95e6359">
<p>
A bilinear map and its associated tensor are essentially the same object once the spaces are fixed.
</p>

</div>
</div>
</div>
<div id="outline-container-org76a666a" class="outline-3">
<h3 id="org76a666a">Rank-one bilinear maps</h3>
<div class="outline-text-3" id="text-org76a666a">
<p>
A rank-one bilinear map has the form
</p>

<p>
\[
(u,v)\mapsto \alpha(u)\beta(v)w
\]
</p>

<p>
where
</p>

<p>
\[
\alpha\in U^*,\qquad \beta\in V^*,\qquad w\in W.
\]
</p>

<p>
Its tensor is
</p>

<p>
\[
\alpha\otimes \beta\otimes w.
\]
</p>
</div>
</div>
<div id="outline-container-org46009cf" class="outline-3">
<h3 id="org46009cf">Tensor rank</h3>
<div class="outline-text-3" id="text-org46009cf">
<div class="defn" id="orgc9690b0">
<p>
The tensor rank \(R(t)\) of
\[
t\in U^*\otimes V^*\otimes W
\]
is the smallest \(r\) such that
\[
t=\sum_{\rho=1}^r \alpha_\rho\otimes \beta_\rho\otimes w_\rho.
\]
</p>

</div>

<p>
For a bilinear map \(f\), we write
</p>

<p>
\[
R(f)=R(t_f).
\]
</p>

<div class="note" id="org82d57c7">
<p>
Computational meaning:
\(R(f)\) is the minimum number of scalar multiplications needed to compute the bilinear map \(f\), ignoring additions and scalar multiplications.
</p>

</div>
</div>
</div>
<div id="outline-container-org4603bcf" class="outline-3">
<h3 id="org4603bcf">Standard diagonal tensor</h3>
<div class="outline-text-3" id="text-org4603bcf">
<p>
Define the standard rank-\(r\) tensor
</p>

<p>
\[
\langle r\rangle
=
\sum_{\rho=1}^r e_\rho^*\otimes e_\rho^*\otimes e_\rho.
\]
</p>

<p>
This represents \(r\) independent scalar multiplications.
</p>

<div class="note" id="org814e156">
<p>
中文：\(\langle r\rangle\) 是最标准的“\(r\) 次乘法模板”。
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-orgaaa6873" class="outline-2">
<h2 id="orgaaa6873">Restriction</h2>
<div class="outline-text-2" id="text-orgaaa6873">
</div>
<div id="outline-container-orgac0dc66" class="outline-3">
<h3 id="orgac0dc66">Definition</h3>
<div class="outline-text-3" id="text-orgac0dc66">
<div class="defn" id="org0d5004a">
<p>
Let
\[
f\in U^*\otimes V^*\otimes W
\]
and
\[
g\in {U'}^*\otimes {V'}^*\otimes W'.
\]
</p>

<p>
We say
\[
f\leq g
\]
if there exist linear maps
\[
A:U\to U',\qquad B:V\to V',\qquad C:W'\to W
\]
such that
\[
f=(A^*\otimes B^*\otimes C)(g).
\]
</p>

</div>

<p>
Equivalent computational interpretation:
</p>

<blockquote>
<p>
Use \(g\) as an oracle. Before feeding inputs into \(g\), apply linear preprocessing. After getting \(g\)'s output, apply linear postprocessing. If this produces \(f\), then \(f\leq g\).
</p>
</blockquote>

<p>
中文直觉：
</p>

<blockquote>
<p>
从一个更大的 bilinear problem 里面，通过线性投影和线性处理，裁剪出一个更小的 bilinear problem。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgdae4f6a" class="outline-3">
<h3 id="orgdae4f6a">Restriction as simulation</h3>
<div class="outline-text-3" id="text-orgdae4f6a">
<p>
If
</p>

<p>
\[
f\leq g,
\]
</p>

<p>
then an algorithm for \(g\) gives an algorithm for \(f\).
</p>

<p>
Thus \(g\) is at least as powerful as \(f\).
</p>

<div class="attention" id="orgd13b85d">
<p>
The direction is easy to confuse:
\[
f\leq g
\]
means \(f\) is reducible to \(g\), or \(g\) can simulate \(f\).
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-orgffb6b8c" class="outline-2">
<h2 id="orgffb6b8c">Rank and Restriction</h2>
<div class="outline-text-2" id="text-orgffb6b8c">
</div>
<div id="outline-container-org11a7f1a" class="outline-3">
<h3 id="org11a7f1a">Monotonicity of rank</h3>
<div class="outline-text-3" id="text-org11a7f1a">
<div class="prop" id="orgcf1ac97">
<p>
If
\[
f\leq g,
\]
then
\[
R(f)\leq R(g).
\]
</p>

</div>

<div class="proof" id="orga78dfd7">
<p>
Assume
</p>

<p>
\[
R(g)=r.
\]
</p>

<p>
Then \(g\) has a rank decomposition
</p>

<p>
\[
g=\sum_{\rho=1}^r x_\rho\otimes y_\rho\otimes z_\rho.
\]
</p>

<p>
Since \(f\leq g\), there exist linear maps \(A,B,C\) such that
</p>

<p>
\[
f=(A\otimes B\otimes C)(g).
\]
</p>

<p>
Applying the linear maps to the decomposition gives
</p>

<p>
\[
f
=
\sum_{\rho=1}^r
A(x_\rho)\otimes B(y_\rho)\otimes C(z_\rho).
\]
</p>

<p>
Each summand is still rank-one or zero. Therefore \(f\) is a sum of at most \(r\) rank-one tensors.
</p>

<p>
Hence
</p>

<p>
\[
R(f)\leq r=R(g).
\]
</p>

<p>
Therefore
</p>

<p>
\[
R(f)\leq R(g).
\]
</p>

</div>

<div class="note" id="org997cb1a">
<p>
中文：restriction 不会增加 rank，因为线性映射会把 rank-one tensor 送到 rank-one tensor 或 \(0\)。
</p>

</div>
</div>
</div>
