public/roam/project/UNSW/ISO(202603)/strassen.html
<div id="outline-container-org044aaea" class="outline-3">
<h3 id="org044aaea">Rank via restriction to diagonal tensor</h3>
<div class="outline-text-3" id="text-org044aaea">
<div class="prop" id="orga710a01">
<p>
For a tensor \(t\),
\[
R(t)\leq r
\]
if and only if
\[
t\leq \langle r\rangle.
\]
</p>

</div>

<div class="proof" id="orgcb4f4c4">
<p>
First suppose
</p>

<p>
\[
R(t)\leq r.
\]
</p>

<p>
Then
</p>

<p>
\[
t=\sum_{\rho=1}^r x_\rho\otimes y_\rho\otimes z_\rho.
\]
</p>

<p>
Define linear maps from the three legs of \(\langle r\rangle\) by sending the \(\rho\)-th standard basis vector to \(x_\rho,y_\rho,z_\rho\), respectively. Applying these maps to
</p>

<p>
\[
\langle r\rangle
=
\sum_{\rho=1}^r e_\rho\otimes e_\rho\otimes e_\rho
\]
</p>

<p>
gives exactly \(t\). Hence
</p>

<p>
\[
t\leq \langle r\rangle.
\]
</p>

<p>
Conversely, if
</p>

<p>
\[
t\leq \langle r\rangle,
\]
</p>

<p>
then by monotonicity,
</p>

<p>
\[
R(t)\leq R(\langle r\rangle)=r.
\]
</p>

<p>
Therefore
</p>

<p>
\[
R(t)\leq r
\iff
t\leq \langle r\rangle.
\]
</p>

</div>

<div class="important" id="org1ac45ba">
<p>
This is why restriction is the correct language for rank.
Rank is just restriction to the diagonal multiplication tensor.
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org599bf18" class="outline-2">
<h2 id="org599bf18">Direct Sum and Tensor Product</h2>
<div class="outline-text-2" id="text-org599bf18">
</div>
<div id="outline-container-org9145a03" class="outline-3">
<h3 id="org9145a03">Direct sum</h3>
<div class="outline-text-3" id="text-org9145a03">
<div class="defn" id="org0d6b993">
<p>
Given bilinear maps
\[
f:U\times V\to W
\]
and
\[
g:U'\times V'\to W',
\]
their direct sum is
\[
f\oplus g:(U\oplus U')\times (V\oplus V')\to W\oplus W'
\]
defined by
\[
(f\oplus g)((u,u'),(v,v'))=(f(u,v),g(u',v')).
\]
</p>

</div>

<p>
中文直觉：
</p>

<blockquote>
<p>
Direct sum means solving two independent bilinear problems side by side.
</p>
</blockquote>

<p>
Tensor notation:
</p>

<p>
\[
t_{f\oplus g}=t_f\oplus t_g.
\]
</p>
</div>
</div>
<div id="outline-container-org29d33ed" class="outline-3">
<h3 id="org29d33ed">Tensor product</h3>
<div class="outline-text-3" id="text-org29d33ed">
<div class="defn" id="org34c5544">
<p>
Given bilinear maps \(f\) and \(g\), their tensor product \(f\otimes g\) is the bilinear problem obtained by multiplying/composing the two problems into a larger one.
</p>

</div>

<p>
On tensors:
</p>

<p>
\[
t_{f\otimes g}=t_f\otimes t_g.
\]
</p>

<p>
中文直觉：
</p>

<blockquote>
<p>
Tensor product means combining two computational problems multiplicatively.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org01e10bd" class="outline-3">
<h3 id="org01e10bd">Difference between \(\oplus\) and \(\otimes\)</h3>
<div class="outline-text-3" id="text-org01e10bd">
<summary id="orga833dfd">
<p>
\(\oplus\): put problems side by side.
</p>

<p>
\(\otimes\): multiply problems into a larger joint problem.
</p>
</summary>

<p>
Examples:
</p>

<p>
\[
\langle a\rangle\oplus \langle b\rangle
=
\langle a+b\rangle.
\]
</p>

<p>
\[
\langle a\rangle\otimes \langle b\rangle
=
\langle ab\rangle.
\]
</p>
</div>
</div>
<div id="outline-container-org4eb8c78" class="outline-3">
<h3 id="org4eb8c78">Why direct sum matters</h3>
<div class="outline-text-3" id="text-org4eb8c78">
<p>
Matrix multiplication complexity studies asymptotic behavior.
</p>

<p>
Tensor powers often decompose into many independent pieces:
</p>

<p>
\[
t^{\otimes N}
\]
</p>

<p>
may contain direct sums of matrix multiplication tensors.
</p>

<p>
Laser method aims to extract many independent matrix multiplication tensors from such powers.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcb8c978" class="outline-2">
<h2 id="orgcb8c978">Semiring Viewpoint</h2>
<div class="outline-text-2" id="text-orgcb8c978">
</div>
<div id="outline-container-orgf5647f5" class="outline-3">
<h3 id="orgf5647f5">Ring</h3>
<div class="outline-text-3" id="text-orgf5647f5">
<div class="defn" id="org723e44a">
<p>
A ring is a set \(R\) with two operations, usually called addition and multiplication, such that:
</p>
<ul class="org-ul">
<li>addition forms an abelian group;</li>
<li>multiplication is associative;</li>
<li>multiplication distributes over addition.</li>
</ul>

</div>

<p>
Distributivity means:
</p>

<p>
\[
a(b+c)=ab+ac,
\]
</p>

<p>
\[
(a+b)c=ac+bc.
\]
</p>
</div>
</div>
<div id="outline-container-orgc6709a2" class="outline-3">
<h3 id="orgc6709a2">Semiring</h3>
<div class="outline-text-3" id="text-orgc6709a2">
<div class="defn" id="org7822117">
<p>
A semiring is like a ring, but additive inverses are not required.
</p>

</div>

<p>
中文：
</p>

<blockquote>
<p>
Semiring 可以做加法和乘法，但不一定能做减法。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgf7bc1f1" class="outline-3">
<h3 id="orgf7bc1f1">Tensor isomorphism classes as a semiring</h3>
<div class="outline-text-3" id="text-orgf7bc1f1">
<p>
In this setting, consider tensor isomorphism classes.
</p>

<p>
Addition is direct sum:
</p>

<p>
\[
[t]+[s]=[t\oplus s].
\]
</p>

<p>
Multiplication is tensor product:
</p>

<p>
\[
[t][s]=[t\otimes s].
\]
</p>

<div class="note" id="org1ed369e">
<p>
This behaves like a commutative semiring.
</p>

</div>
</div>
</div>
<div id="outline-container-org6c3ce38" class="outline-3">
<h3 id="org6c3ce38">Why semiring language is useful</h3>
<div class="outline-text-3" id="text-org6c3ce38">
<p>
It lets us discuss:
</p>

<ul class="org-ul">
<li>powers \(t^{\otimes n}\),</li>
<li>sums \(t\oplus s\),</li>
<li>preorder \(t\leq s\),</li>
<li>asymptotic rank,</li>
<li>degeneration,</li>
<li>extraction of many copies.</li>
</ul>

<summary id="org1502378">
<p>
The semiring viewpoint turns tensor complexity into an algebraic order problem.
</p>
</summary>
</div>
</div>
</div>
<div id="outline-container-orgb3a316c" class="outline-2">
<h2 id="orgb3a316c">Asymptotic and Border Rank</h2>
<div class="outline-text-2" id="text-orgb3a316c">
</div>
<div id="outline-container-org233edaf" class="outline-3">
<h3 id="org233edaf">Asymptotic rank</h3>
<div class="outline-text-3" id="text-org233edaf">
<div class="defn" id="org1285781">
<p>
The asymptotic rank of a tensor \(t\) is
\[
\widetilde R(t)
=
\lim_{n\to\infty} R(t^{\otimes n})^{1/n},
\]
when the limit exists.
</p>

</div>

<p>
Usually, the limit exists by submultiplicativity and Fekete's lemma.
</p>

<div class="note" id="orgefa7277">
<p>
中文：asymptotic rank 衡量 tensor powers 长大后 rank 的指数级增长率。
</p>

</div>
</div>
</div>
<div id="outline-container-org9bc7f1e" class="outline-3">
<h3 id="org9bc7f1e">Why asymptotic rank matters</h3>
<div class="outline-text-3" id="text-org9bc7f1e">
<p>
For matrix multiplication tensor,
</p>

<p>
\[
\langle n,n,n\rangle,
\]
</p>

<p>
rank controls exact algorithms, but asymptotic rank controls \(\omega\).
</p>

<p>
Roughly:
</p>

<p>
\[
R(\langle n,n,n\rangle)
\approx n^\omega.
\]
</p>
</div>
</div>
<div id="outline-container-org919c3fb" class="outline-3">
<h3 id="org919c3fb">Border rank</h3>
<div class="outline-text-3" id="text-org919c3fb">
<div class="defn" id="orgc0610f4">
<p>
The border rank \(\underline R(t)\) is the smallest \(r\) such that \(t\) is a limit of tensors of rank at most \(r\).
</p>

</div>

<p>
Formally, \(t\) has border rank at most \(r\) if there exists a family \(t_\epsilon\) such that:
</p>

<p>
\[
R(t_\epsilon)\leq r
\]
</p>

<p>
for all \(\epsilon\neq 0\), and
</p>

<p>
\[
\lim_{\epsilon\to 0}t_\epsilon=t.
\]
</p>

<div class="note" id="orge0460e1">
<p>
中文：border rank 允许“极限近似算出来”，不要求每一步都精确等于目标 tensor。
</p>

</div>
</div>
</div>
<div id="outline-container-orgf7b5e12" class="outline-3">
<h3 id="orgf7b5e12">Degeneration</h3>
<div class="outline-text-3" id="text-orgf7b5e12">
<div class="defn" id="orgffd45de">
<p>
A tensor \(t\) is a degeneration of \(s\), written informally as
\[
t\unlhd s,
\]
if \(t\) can be obtained from \(s\) by a limiting family of restrictions.
</p>

</div>

<p>
Restriction:
</p>

<p>
\[
t\leq s
\]
</p>

<p>
means exact simulation.
</p>

<p>
Degeneration:
</p>

<p>
\[
t\unlhd s
\]
</p>

<p>
means approximate or limiting simulation.
</p>

<div class="attention" id="org0c426ef">
<p>
\[
t\leq s
\]
is exact.
</p>

<p>
\[
t\unlhd s
\]
is approximate / limiting.
</p>

</div>
</div>
</div>
<div id="outline-container-orgdc57e75" class="outline-3">
<h3 id="orgdc57e75">From degeneration to exact restriction with overhead</h3>
<div class="outline-text-3" id="text-orgdc57e75">
<p>
A key Strassen-style move:
</p>

<blockquote>
<p>
Approximate restriction can often be converted into exact restriction after paying an additional diagonal tensor factor.
</p>
</blockquote>

<p>
Informally, polynomial interpolation turns parameterized approximations into exact computations.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd7a2f12" class="outline-2">
<h2 id="orgd7a2f12">Laser Method Intuition</h2>
<div class="outline-text-2" id="text-orgd7a2f12">
</div>
<div id="outline-container-org4e4473c" class="outline-3">
<h3 id="org4e4473c">Problem</h3>
<div class="outline-text-3" id="text-org4e4473c">
<p>
Tensor powers \(t^{\otimes N}\) are huge and complicated.
</p>

<p>
They may contain many pieces, but not obviously in a clean direct sum form.
</p>
</div>
</div>
<div id="outline-container-org28995cc" class="outline-3">
<h3 id="org28995cc">Goal</h3>
<div class="outline-text-3" id="text-org28995cc">
<p>
Extract from \(t^{\otimes N}\) a large direct sum of matrix multiplication tensors:
</p>

<p>
\[
\bigoplus_i \langle a_i,b_i,c_i\rangle.
\]
</p>

<p>
Then compare ranks:
</p>

<p>
\[
\sum_i R(\langle a_i,b_i,c_i\rangle)
\leq
R(t^{\otimes N}).
\]
</p>
</div>
</div>
<div id="outline-container-org3b7bd25" class="outline-3">
<h3 id="org3b7bd25">Laser idea</h3>
<div class="outline-text-3" id="text-org3b7bd25">
<summary id="orgb2c0fe4">
<p>
The laser method selects a structured part of the support of \(t^{\otimes N}\), zeros out unwanted components, and keeps many independent matrix multiplication tensors.
</p>
</summary>

<p>
中文：
</p>

<blockquote>
<p>
像用激光一样，从一个很大的 tensor power 里面切出大量互不干扰的矩阵乘法子问题。
</p>
</blockquote>
</div>
</div>
