public/roam/project/UNSW/ISO(202603)/strassen.html
<div id="outline-container-org89ed1bf" class="outline-3">
<h3 id="org89ed1bf">Support and weights</h3>
<div class="outline-text-3" id="text-org89ed1bf">
<p>
A tensor has support
</p>

<p>
\[
\operatorname{supp}(t)
=
\{(i,j,k):t_{ijk}\neq 0\}.
\]
</p>

<p>
Laser method often assigns weights to support elements and chooses subsets satisfying certain compatibility constraints.
</p>

<p>
This creates direct-sum-like behavior.
</p>
</div>
</div>
<div id="outline-container-org0e97434" class="outline-3">
<h3 id="org0e97434">Mass extraction</h3>
<div class="outline-text-3" id="text-org0e97434">
<p>
The objective is to extract many copies with large total “mass”.
</p>

<p>
This gives inequalities that imply upper bounds on \(\omega\).
</p>

<div class="note" id="org8b1ec47">
<p>
Page 4 的 proof route 写成：
exact order
\(\to\)
approximate order
\(\to\)
formalization over \(K(\epsilon)\)
\(\to\)
weight certificate on support
\(\to\)
mass extraction
\(\to\)
\(\omega\)-theorem.
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org1047a8f" class="outline-2">
<h2 id="org1047a8f">Krull-Schmidt and Decomposition</h2>
<div class="outline-text-2" id="text-org1047a8f">
</div>
<div id="outline-container-orgde586c5" class="outline-3">
<h3 id="orgde586c5">Indecomposable tensors</h3>
<div class="outline-text-3" id="text-orgde586c5">
<div class="defn" id="org4273e57">
<p>
A tensor \(t\) is indecomposable if it cannot be written as a nontrivial direct sum
\[
t=s\oplus u.
\]
</p>

</div>

<p>
中文：
</p>

<blockquote>
<p>
不能再分成两个独立计算问题的 tensor，称为 indecomposable。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org7c4f037" class="outline-3">
<h3 id="org7c4f037">Krull-Schmidt theorem</h3>
<div class="outline-text-3" id="text-org7c4f037">
<div class="thm" id="org8a1d32a">
<p>
Under suitable conditions, if an object decomposes as a finite direct sum of indecomposable objects in two ways,
\[
A_1\oplus\cdots\oplus A_n
\cong
B_1\oplus\cdots\oplus B_m,
\]
then
\[
n=m,
\]
and after a permutation, corresponding summands are isomorphic.
</p>

</div>

<p>
中文：
</p>

<blockquote>
<p>
如果一个对象可以分解成若干不可分解对象，那么这种分解本质上唯一，只差排列和同构。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5979c46" class="outline-3">
<h3 id="org5979c46">Basis as finest one-dimensional decomposition</h3>
<div class="outline-text-3" id="text-org5979c46">
<p>
A basis gives a finest decomposition of a vector space into one-dimensional pieces:
</p>

<p>
\[
V=Ke_1\oplus\cdots\oplus Ke_n.
\]
</p>

<p>
Block decomposition is a coarser decomposition:
</p>

<p>
\[
V=V_1\oplus\cdots\oplus V_r.
\]
</p>

<div class="note" id="orga9376f5">
<p>
中文：basis 是最细的一维分解；block decomposition 是更粗粒度的分解。
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org23e8a89" class="outline-2">
<h2 id="org23e8a89">Linear Algebra Rewritten by Direct Sum and Tensor Product</h2>
<div class="outline-text-2" id="text-org23e8a89">
</div>
<div id="outline-container-org953b1f8" class="outline-3">
<h3 id="org953b1f8">Traditional order</h3>
<div class="outline-text-3" id="text-org953b1f8">
<p>
Common linear algebra is often taught as:
</p>

<p>
\[
\text{vectors}
\to
\text{matrices}
\to
\text{linear maps}
\to
\text{eigenvectors}
\to
\text{bilinear maps}.
\]
</p>
</div>
</div>
<div id="outline-container-orgc01ba63" class="outline-3">
<h3 id="orgc01ba63">Tensor-complexity order</h3>
<div class="outline-text-3" id="text-orgc01ba63">
<p>
Using direct sum and tensor product, one can reorganize it as:
</p>

<p>
\[
\text{spaces}
\to
\text{decompositions}
\to
\text{maps as tensors}
\to
\oplus
\to
\otimes.
\]
</p>

<summary id="org6d202f2">
<p>
The point is to treat decomposition and composition of spaces as primary, instead of treating matrices as the starting point.
</p>
</summary>
</div>
</div>
<div id="outline-container-orgafb9618" class="outline-3">
<h3 id="orgafb9618">Vector spaces</h3>
<div class="outline-text-3" id="text-orgafb9618">
<p>
A vector space can be understood through decompositions.
</p>

<p>
For a basis \(e_1,\dots,e_n\),
</p>

<p>
\[
V=Ke_1\oplus\cdots\oplus Ke_n.
\]
</p>

<p>
Dimension satisfies:
</p>

<p>
\[
\dim(V\oplus W)=\dim V+\dim W.
\]
</p>
</div>
</div>
<div id="outline-container-org872be8f" class="outline-3">
<h3 id="org872be8f">Linear maps as block matrices</h3>
<div class="outline-text-3" id="text-org872be8f">
<p>
Suppose
</p>

<p>
\[
V=V_1\oplus\cdots\oplus V_m,
\]
</p>

<p>
\[
W=W_1\oplus\cdots\oplus W_n.
\]
</p>

<p>
A linear map
</p>

<p>
\[
T:V\to W
\]
</p>

<p>
can be viewed as a block matrix with components
</p>

<p>
\[
T_{ij}:V_j\to W_i.
\]
</p>

<div class="note" id="orgf3220db">
<p>
中文：matrix 的本质是 linear map 在 direct-sum decomposition 下的 block description。
</p>

</div>
</div>
</div>
<div id="outline-container-org7e790d3" class="outline-3">
<h3 id="org7e790d3">Dual space</h3>
<div class="outline-text-3" id="text-org7e790d3">
<div class="defn" id="orgb852d68">
<p>
The dual space of \(V\) is
\[
V^*=\operatorname{Hom}(V,K).
\]
Its elements are linear functionals
\[
\phi:V\to K.
\]
</p>

</div>

<p>
中文直觉：
</p>

<blockquote>
<p>
Dual vectors are linear measurements / linear probes.
</p>
</blockquote>

<p>
If
</p>

<p>
\[
V=Ke_1\oplus\cdots\oplus Ke_n,
\]
</p>

<p>
then the dual basis
</p>

<p>
\[
e_1^*,\dots,e_n^*
\]
</p>

<p>
is defined by
</p>

<p>
\[
e_i^*(e_j)=\delta_{ij}.
\]
</p>
</div>
</div>
<div id="outline-container-org4153b75" class="outline-3">
<h3 id="org4153b75">Linear maps as tensors</h3>
<div class="outline-text-3" id="text-org4153b75">
<p>
There is a canonical isomorphism
</p>

<p>
\[
\operatorname{Hom}(V,W)\cong V^*\otimes W.
\]
</p>

<p>
Thus a linear map
</p>

<p>
\[
T:V\to W
\]
</p>

<p>
can be regarded as a tensor
</p>

<p>
\[
T\in V^*\otimes W.
\]
</p>

<p>
With bases,
</p>

<p>
\[
T=\sum_{i,j} a_{ij}e_i^*\otimes w_j.
\]
</p>

<div class="note" id="orgee7c2c4">
<p>
中文：\(e_i^*\) 是 input detector，\(w_j\) 是 output direction，系数 \(a_{ij}\) 就是矩阵条目。
</p>

</div>
</div>
</div>
<div id="outline-container-orga1a0786" class="outline-3">
<h3 id="orga1a0786">Bilinear maps as tensors</h3>
<div class="outline-text-3" id="text-orga1a0786">
<p>
Similarly,
</p>

<p>
\[
\operatorname{Bilin}(U,V;W)
\cong
U^*\otimes V^*\otimes W.
\]
</p>

<p>
So a bilinear map
</p>

<p>
\[
f:U\times V\to W
\]
</p>

<p>
is a tensor with two input probes and one output direction.
</p>
</div>
</div>
</div>
<div id="outline-container-orga1ca427" class="outline-2">
<h2 id="orga1ca427">Proof Templates</h2>
<div class="outline-text-2" id="text-orga1ca427">
</div>
<div id="outline-container-org62864fa" class="outline-3">
<h3 id="org62864fa">Template: prove restriction monotonicity of rank</h3>
<div class="outline-text-3" id="text-org62864fa">
<div class="proof" id="org47594cf">
<p>
Assume \(f\leq g\). Then there exist linear maps on the three tensor legs such that
</p>

<p>
\[
f=(A\otimes B\otimes C)(g).
\]
</p>

<p>
Let
</p>

<p>
\[
g=\sum_{\rho=1}^{R(g)}x_\rho\otimes y_\rho\otimes z_\rho
\]
</p>

<p>
be a minimal rank decomposition of \(g\). Applying the linear maps gives
</p>

<p>
\[
f=
\sum_{\rho=1}^{R(g)}
A(x_\rho)\otimes B(y_\rho)\otimes C(z_\rho).
\]
</p>

<p>
Each summand is rank-one or zero. Hence \(f\) has a rank decomposition using at most \(R(g)\) rank-one tensors. Therefore
</p>

<p>
\[
R(f)\leq R(g).
\]
</p>

</div>
</div>
</div>
<div id="outline-container-orgfebdc6f" class="outline-3">
<h3 id="orgfebdc6f">Template: prove \(R(t)\leq r\iff t\leq \langle r\rangle\)</h3>
<div class="outline-text-3" id="text-orgfebdc6f">
<div class="proof" id="org9b83e10">
<p>
If \(R(t)\leq r\), then
</p>

<p>
\[
t=\sum_{\rho=1}^r x_\rho\otimes y_\rho\otimes z_\rho.
\]
</p>

<p>
The diagonal tensor is
</p>

<p>
\[
\langle r\rangle=\sum_{\rho=1}^r e_\rho\otimes e_\rho\otimes e_\rho.
\]
</p>

<p>
Define linear maps sending \(e_\rho\) to \(x_\rho\), \(y_\rho\), and \(z_\rho\) on the three legs. Then \(\langle r\rangle\) restricts to \(t\), so
</p>

<p>
\[
t\leq \langle r\rangle.
\]
</p>

<p>
Conversely, if \(t\leq \langle r\rangle\), then by monotonicity,
</p>

<p>
\[
R(t)\leq R(\langle r\rangle)=r.
\]
</p>

<p>
Therefore
</p>

<p>
\[
R(t)\leq r
\iff
t\leq \langle r\rangle.
\]
</p>

</div>
</div>
</div>
<div id="outline-container-org99cdc04" class="outline-3">
<h3 id="org99cdc04">Template: explain direct sum</h3>
<div class="outline-text-3" id="text-org99cdc04">
<div class="answer" id="org0fdd6d8">
<p>
The direct sum \(f\oplus g\) means solving two independent bilinear problems side by side. Its input spaces, output spaces, and tensor are all direct sums of the corresponding pieces. Computationally, no cross terms are used between the \(f\)-part and the \(g\)-part.
</p>

</div>
</div>
</div>
<div id="outline-container-org92e6dba" class="outline-3">
<h3 id="org92e6dba">Template: explain tensor product</h3>
<div class="outline-text-3" id="text-org92e6dba">
<div class="answer" id="org95e6766">
<p>
The tensor product \(f\otimes g\) means combining two bilinear problems multiplicatively into a larger bilinear problem. It is not merely placing problems side by side; it creates a product structure where the dimensions and rank behavior multiply.
</p>

</div>
</div>
</div>
<div id="outline-container-org6a731d7" class="outline-3">
<h3 id="org6a731d7">Template: explain restriction</h3>
<div class="outline-text-3" id="text-org6a731d7">
<div class="answer" id="orgd4512f1">
<p>
A restriction \(f\leq g\) means \(f\) can be obtained from \(g\) by linear preprocessing of inputs and linear postprocessing of outputs. Hence an algorithm for \(g\) gives an algorithm for \(f\). This makes restriction a computational preorder.
</p>

</div>
</div>
</div>
