public/roam/project/UNSW/ISO(202603)/strassen.html
<div id="outline-container-org683a115" class="outline-3">
<h3 id="org683a115">Template: explain border rank</h3>
<div class="outline-text-3" id="text-org683a115">
<div class="answer" id="org8281a50">
<p>
Border rank allows approximate computation in a limiting sense. A tensor \(t\) has border rank at most \(r\) if it is the limit of tensors of rank at most \(r\). Thus border rank can be smaller than ordinary rank because it permits degeneration.
</p>

</div>
</div>
</div>
<div id="outline-container-org8f338ff" class="outline-3">
<h3 id="org8f338ff">Template: explain laser method</h3>
<div class="outline-text-3" id="text-org8f338ff">
<div class="answer" id="org0cf3b48">
<p>
The laser method studies large tensor powers \(t^{\otimes N}\). These powers contain many structured components. By selecting a suitable support subset and zeroing out incompatible parts, one extracts a large direct sum of independent matrix multiplication tensors. This extraction yields inequalities that imply upper bounds on the matrix multiplication exponent \(\omega\).
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org7285a0c" class="outline-2">
<h2 id="org7285a0c">Common Mistakes</h2>
<div class="outline-text-2" id="text-org7285a0c">
</div>
<div id="outline-container-org874a279" class="outline-3">
<h3 id="org874a279">Mistake 1: Confusing restriction direction</h3>
<div class="outline-text-3" id="text-org874a279">
<p>
Wrong:
</p>

<p>
\[
f\leq g
\quad
\text{means}
\quad
f \text{ can compute } g.
\]
</p>

<p>
Correct:
</p>

<p>
\[
f\leq g
\quad
\text{means}
\quad
g \text{ can simulate } f.
\]
</p>
</div>
</div>
<div id="outline-container-orgbe90026" class="outline-3">
<h3 id="orgbe90026">Mistake 2: Confusing direct sum and tensor product</h3>
<div class="outline-text-3" id="text-orgbe90026">
<p>
Direct sum:
</p>

<p>
\[
f\oplus g
\]
</p>

<p>
means independent side-by-side computation.
</p>

<p>
Tensor product:
</p>

<p>
\[
f\otimes g
\]
</p>

<p>
means multiplicative combination into a larger problem.
</p>
</div>
</div>
<div id="outline-container-org0d7315f" class="outline-3">
<h3 id="org0d7315f">Mistake 3: Thinking border rank is exact rank</h3>
<div class="outline-text-3" id="text-org0d7315f">
<p>
Rank asks:
</p>

<p>
\[
t=\sum_{\rho=1}^r \text{rank-one tensors}.
\]
</p>

<p>
Border rank asks:
</p>

<p>
\[
t=\lim_{\epsilon\to 0}t_\epsilon
\]
</p>

<p>
where each \(t_\epsilon\) has rank at most \(r\).
</p>
</div>
</div>
<div id="outline-container-org381f409" class="outline-3">
<h3 id="org381f409">Mistake 4: Treating tensor coordinates as intrinsic</h3>
<div class="outline-text-3" id="text-org381f409">
<p>
Coordinates depend on basis choice.
</p>

<p>
The intrinsic object is the tensor orbit under changes of bases:
</p>

<p>
\[
\operatorname{GL}(U)\times \operatorname{GL}(V)\times \operatorname{GL}(W).
\]
</p>
</div>
</div>
<div id="outline-container-org73c74a2" class="outline-3">
<h3 id="org73c74a2">Mistake 5: Forgetting asymptotic behavior</h3>
<div class="outline-text-3" id="text-org73c74a2">
<p>
Strassen-style tensor complexity is not only about one tensor.
</p>

<p>
It studies tensor powers:
</p>

<p>
\[
t^{\otimes n}
\]
</p>

<p>
and limiting quantities such as
</p>

<p>
\[
\widetilde R(t)
=
\lim_{n\to\infty}R(t^{\otimes n})^{1/n}.
\]
</p>
</div>
</div>
</div>
<div id="outline-container-orgefd9ab0" class="outline-2">
<h2 id="orgefd9ab0">Minimal Memory Version</h2>
<div class="outline-text-2" id="text-orgefd9ab0">
<summary id="org21bee5f">
<p>
Strassen 1987 can be understood as follows:
</p>

<ol class="org-ol">
<li>Matrix multiplication is a bilinear map, hence a tensor.</li>
<li>Tensor rank measures bilinear multiplication complexity.</li>
<li>Restriction \(f\leq g\) means \(g\) can simulate \(f\).</li>
<li>Rank is monotone under restriction:
\[
   f\leq g\implies R(f)\leq R(g).
   \]</li>
<li>\(R(t)\leq r\) iff \(t\leq \langle r\rangle\).</li>
<li>Direct sum means independent side-by-side problems.</li>
<li>Tensor product means multiplicative composition of problems.</li>
<li>Tensor isomorphism classes with \(\oplus\) and \(\otimes\) form a semiring-like structure.</li>
<li>Border rank allows limiting approximations.</li>
<li>Asymptotic rank studies \(R(t^{\otimes n})^{1/n}\).</li>
<li>Laser method extracts many independent matrix multiplication tensors from tensor powers.</li>
<li>This machinery gives upper bounds on the matrix multiplication exponent \(\omega\).</li>
</ol>
</summary>
</div>
</div>
</div>
</body>
</html>
